var pr = "47,A 安徽,11,B 北京,43,C 重庆,12,F 福建,57,G 甘肃,13,G 广东,35,G 广西,54,G 贵州,56,H 海南,37,H 河北,48,H 黑龙江,38,H 河南,39,H 湖北,40,H 湖南,14,J 江苏,46,J 江西,49,J 吉林,50,L 辽宁,58,N 内蒙古,55,N 宁夏,61,Q 青海,15,S 山东,16,S 上海,45,S 陕西,44,S 山西,17,S 四川,52,T 天津,59,X 新疆,60,X 西藏,53,Y 云南,18,Z 浙江,";
var ct = [];
ct[11]="439,北京市";
ct[12]="1,福州市,2,厦门市,3,莆田市,4,三明市,5,泉州市,6,漳州市,7,南平市,8,龙岩市,9,宁德市,";
ct[13]="40,广州市,41,韶关市,42,深圳市,43,珠海市,44,汕头市,45,佛山市,46,江门市,47,湛江市,48,茂名市,49,肇庆市,50,惠州市,51,梅州市,52,汕尾市,53,河源市,54,阳江市,55,清远市,56,东莞市,57,中山市,58,潮州市,59,揭阳市,60,云浮市,";
ct[14]="75,南京市,76,无锡市,77,徐州市,78,常州市,79,苏州市,80,南通市,81,连云港市,82,淮安市,83,盐城市,84,扬州市,85,镇江市,86,泰州市,87,宿迁市,";
ct[15]="304,济南市,305,青岛市,306,淄博市,307,枣庄市,308,东营市,309,烟台市,310,潍坊市,311,济宁市,312,泰安市,313,威海市,314,日照市,315,莱芜市,316,临沂市,317,德州市,318,聊城市,319,滨州市,320,荷泽市,";
ct[16]="438,上海市";
ct[17]="160,成都市,161,自贡市,162,攀枝花市,163,泸州市,164,德阳市,165,绵阳市,166,广元市,167,遂宁市,168,内江市,169,乐山市,170,南充市,171,宜宾市,172,广安市,173,达州市,174,雅安市,175,阿坝藏族羌族自治州,176,甘孜藏族自治州,177,凉山彝族自治州,178,巴中市,179,眉山市,180,资阳市,";
ct[18]="10,杭州市,11,宁波市,12,温州市,13,嘉兴市,14,湖州市,15,绍兴市,16,金华市,17,衢州市,18,舟山市,19,台州市,20,丽水市,";
ct[35]="61,南宁市,62,柳州市,63,桂林市,64,梧州市,65,北海市,66,防城港市,67,钦州市,68,贵港市,69,玉林市,72,贺州市,73,百色市,74,河池市,";
ct[37]="88,石家庄市,89,唐山市,90,秦皇岛市,91,邯郸市,92,邢台市,93,保定市,94,张家口市,95,承德市,96,沧州市,97,廊坊市,98,衡水市,";
ct[38]="99,郑州市,100,开封市,101,洛阳市,102,平顶山市,103,安阳市,104,鹤壁市,105,新乡市,106,焦作市,107,濮阳市,108,许昌市,109,漯河市,110,三门峡市,111,南阳市,112,商丘市,113,信阳市,114,周口市,115,驻马店市,";
ct[39]="116,武汉市,117,黄石市,118,十堰市,119,宜昌市,120,襄樊市,121,鄂州市,122,荆门市,123,孝感市,124,荆州市,125,黄冈市,126,咸宁市,404,潜江市,405,随州市,423,天门市,127,恩施土家族苗族自治州,";
ct[40]="128,长沙市,129,株洲市,130,湘潭市,131,衡阳市,132,邵阳市,133,岳阳市,134,常德市,135,张家界市,136,益阳市,137,郴州市,138,永州市,139,怀化市,140,娄底市,141,湘西土家族苗族自治州,";
ct[43]="437,重庆市";
ct[44]="221,太原市,222,大同市,223,阳泉市,224,长治市,225,晋城市,226,朔州市,227,忻州市,228,吕梁市,229,晋中市,230,临汾市,231,运城市,";
ct[45]="232,西安市,233,铜川市,234,宝鸡市,235,咸阳市,236,渭南市,237,延安市,238,汉中市,239,安康市,240,商洛市,241,榆林市,";
ct[46]="242,南昌市,243,景德镇市,244,萍乡市,245,九江市,246,新余市,247,赣州市,248,宜春市,249,上饶市,250,吉安市,251,抚州市,422,鹰潭市";
ct[47]="252,合肥市,406,亳州市,253,芜湖市,254,蚌埠市,255,淮南市,256,马鞍山市,257,淮北市,258,铜陵市,259,安庆市,260,黄山市,261,滁州市,262,阜阳市,263,宿州市,264,六安市,265,宣城市,266,巢湖市,267,池州市,";
ct[48]="268,哈尔滨市,269,齐齐哈尔市,270,鸡西市,271,鹤岗市,272,双鸭山市,273,大庆市,274,伊春市,275,佳木斯市,276,七台河市,277,牡丹江市,278,黑河市,279,绥化市,280,大兴安岭市,";
ct[49]="281,长春市,282,吉林市,283,四平市,284,辽源市,285,通化市,286,白山市,287,松原市,288,白城市,289,延边朝鲜族自治州,";
ct[50]="290,沈阳市,291,大连市,292,鞍山市,293,抚顺市,294,本溪市,295,丹东市,296,锦州市,297,营口市,298,阜新市,299,辽阳市,300,盘锦市,301,铁岭市,302,朝阳市,303,葫芦岛市,402,开原市,";
ct[52]="440,天津市";
ct[53]="339,昆明市,340,曲靖市,341,玉溪市,342,昭通市,343,楚雄彝族自治州,344,红河哈尼族彝族自治州,345,文山壮族苗族自治州,346,思茅市,347,西双版纳傣族自治州,348,大理白族自治州,349,保山市,350,德宏傣族景颇族自治州,351,丽江市,352,怒江傈僳族自治州,353,迪庆藏族自治州,354,临沧市,";
ct[54]="355,贵阳市,356,六盘水市,357,遵义市,358,铜仁市,359,黔西南布依族苗族自治州,360,毕节市,361,安顺市,362,黔东南苗族侗族自治州,363,黔南布依族苗族自治州,";
ct[55]="364,银川市,365,石嘴山市,366,吴忠市,367,固原市,";
ct[56]="368,海口市,369,三亚市,441,五指山市,442,琼海市,443,儋州市,444,文昌市,445,万宁市,446,东方市,447,澄迈县,448,定安县,449,屯昌县,450,临高县";
ct[57]="370,兰州市,371,嘉峪关市,372,金昌市,373,白银市,374,天水市,375,酒泉市,376,张掖市,377,武威市,378,定西市,379,陇南市,380,平凉市,381,庆阳市,382,临夏回族自治州,383,甘南藏族自治州,";
ct[58]="384,呼和浩特市,385,包头市,386,乌海市,387,赤峰市,388,呼伦贝尔盟,389,兴安盟,390,哲里木盟,391,锡林郭勒盟,392,乌兰察布盟,393,鄂尔多斯,394,巴彦淖尔盟,395,阿拉善盟,";
ct[59]="403,乌鲁木齐市,425,克拉玛依市,426,吐鲁番地区,427,哈密地区,428,阿克苏地区,429,喀什地区,430,和田地区,431,阿勒泰地区,432,昌吉回族自治州,433,博尔塔拉蒙古自治州,434,巴音郭楞蒙古自治州,435,克孜勒苏柯尔克孜自治州,436,伊犁哈萨克自治州,451,昌吉回族自治州,452,博尔塔拉蒙古自治州,453,巴音郭楞蒙古自治州,454,克孜勒苏柯尔克孜自治州,455,伊犁哈萨克自治州,456,石河子市,457,阿拉尔市,458,图木舒克市,459,五家渠市";
ct[60]="407,拉萨市,408,日喀则市,409,山南市,410,林芝市,411,昌都市,412,那曲市,413,阿里市,";
ct[61]="414,西宁市,415,海东市,416,海北藏族自治州,417,黄南藏族自治州,418,海南藏族自治州,419,果洛藏族自治州,420,玉树藏族自治州,421,海西蒙古族藏族自治州,";

var dit=[];
dit[1]="1,福州市,2,福清市,3,闽候县,4,闽清县,5,连江县,6,长乐市,7,罗源县,8,永泰县,9,平潭县,38,马尾区";
dit[9]="10,宁德市,11,蕉城区,12,福安,13,福鼎,14,霞浦,15,柘荣,16,寿宁,17,古田,18,屏南,19,周宁";
dit[2]="20,思明,21,湖里,22,集美,23,海沧,24,同安,25,翔安";
dit[5]="26,鲤城区,27,丰泽区,28,洛江区,37,泉港区,29,晋江市,30,石狮市,31,南安市,32,惠安县,33,安溪县,34,永春县,35,德化县,36,金门县";
dit[248]="39,袁州区,40,丰城市,41,樟树市,42,高安市,43,奉新县,44,万载县,45,上高县,46,宜丰县,47,靖安县,48,铜鼓县";
dit[79]="49,苏州市,50,张家港市,51,常熟市,52,太仓市,53,昆山市,54,吴江市";
dit[3]="55,莆田市,56,仙游县";
dit[76]="57,无锡市,58,江阴市,59,宜兴市";
dit[15]="60,绍兴县,61,诸暨市,62,上虞市,63,嵊州市,64,新昌县,65,越城区";
dit[14]="66,吴兴区,67,南浔区,68,德清县,69,长兴县,70,安吉县";
dit[86]="71,兴化市,72,靖江市,73,泰兴市,74,姜堰市,75,海陵区,76,高港区";
dit[12]="77,鹿城区,78,龙湾区,79,瓯海区,80,瑞安市,81,乐清市,82,永嘉县,83,洞头县,84,平阳县,85,苍南县,86,文成县,87,泰顺县";
dit[241]="88,榆阳区,89,神木县,90,府谷县,91,横山县,92,靖边县,93,定边县,94,绥德县,95,米脂县,96,佳县,97,吴堡县,98,清涧县,99,子洲县";
dit[437]="100,渝中区,101,大渡口区,102,江北区,103,沙坪坝区,104,九龙坡区,105,南岸区,106,北碚区,107,綦江区,108,双桥区,109,渝北区,110,巴南区,111,万州区,112,涪陵区,113,黔江区,114,长寿区,115,江津区,116,合川区,117,永川区,118,南川区,119,綦江县,120,潼南县,121,铜梁县,122,大足县,123,荣昌县,124,璧山县,125,梁平县,126,城口县,125,丰都县,128,垫江县,129,武隆县,130,忠县,131,开县,132,云阳县,133,奉节县,134,巫山县,135,巫溪县,136,石柱土家族自治县,137,秀山土家族苗族自治县,138,酉阳土家族苗族自治县,139,彭水苗族土家族自治县";
dit[438]="200,黄浦区,201,卢湾区,202,徐汇区,203,长宁区,204,静安区,205,普陀区,206,闸北区,207,虹口区,208,杨浦区,209,闵行区,210,宝山区,211,嘉定区,212,浦东新区,213,金山区,214,松江区,215,南汇区,216,奉贤区,217,青浦区,218,崇明县,";
dit[439]="146,C 朝阳区,154,C 昌平区,144,C 崇文区,155,D 大兴区,142,D 东城区,151,F 房山区,147,F 丰台区,149,H 海淀区,157,H 怀柔区,150,M 门头沟区,158,M 密云县,156,P 平谷区,153,S 顺义区,148,S 石景山区,152,T 通州区,145,X 宣武区,143,X 西城区,159,Y 延庆县,"
dit[440]="337,B 宝坻区,333,B 北辰区,329,D 大港区,330,D 东丽区,325,H 河北区,326,H 红桥区,323,H 河西区,322,H 河东区,321,H 和平区,328,H 汉沽区,332,J 津南区,336,J 静海县,338,J 蓟县,324,N 南开区,334,N 宁河县,327,T 塘沽区,335,W 武清区,331,X 西青区,"
dit[85]="140,京口区,141,润州区,162,丹徒区,163,句容市,164,丹阳市,165,扬中市"
dit[16]="340,婺城区,341,金东区,342,兰溪市,343,义乌市,344,东阳市,345,永康市,346,浦江县,347,武义县,359,磐安县"
dit[6]="348,芗城区,349,龙文区,350,龙海市,351,云霄县,352,漳浦县,353,诏安县,354,长泰县,355,东山县,356,南靖县,357,平和县,358,华安县"
dit[13]="360,南湖区,361,秀洲区,362,经济技术开发区,363,嘉善县,364,海盐县,365,平湖市,366,海宁市,367,桐乡市"
dit[128]="368,芙蓉区,369,天心区,370,岳麓区,371,开福区,372,雨花区,373,望城区,374,浏阳市,375,长沙县,376,宁乡县"
//===//
function showP(p){
	var j=0;
	p.options.length=0;
	p.options.length++;
	p.options[j].text='选择省份';
	p.options[j].value=0;
	j++;
	var ps = pr.split(',');
	for(i=0;i<ps.length-1;i+=2) {
		p.options.length++;
		p.options[j].text=ps[i+1];
		p.options[j].value=ps[i];
		j++;
	}
}
function setCity(p,c,d) {
    c.disabled = true;
	c.options.length=0;
	c.options.length++;
	c.options[0].text="选择城市";
	c.options[0].value="0";
	param=p.selectedIndex;
	pid=p.options[param].value;
	if(pid>0) {
        c.disabled = false;
		j=1;
		var cs = ct[pid].split(',');
		for(i=0;i<cs.length-1;i+=2) {
			c.options.length++;
			c.options[j].text=cs[i+1];
			c.options[j].value=cs[i];
			j++;
		}
	}
    if (d!=null) {
        d.style.display = 'none';
    }
}
function setDistrict(c,d){
	d.options.length=0;
	d.options.length++;
	d.options[0].text="选择区县";
	d.options[0].value="0";
	param=c.selectedIndex;
	pid=c.options[param].value;
	if(pid>0 && typeof(dit[pid])!='undefined'){
		d.style.display = '';
		j=1;
		var ds=dit[pid].split(',');
		for(i=0;i<ds.length-1;i+=2){
			d.options.length++;
			d.options[j].text=ds[i+1];
			d.options[j].value=ds[i];
			j++
		}
	} else {
		d.style.display = 'none';
	}
}
