<?php defined('BASEPATH') OR exit('No direct script access allowed');

$config['years'] = [
    0 => '年份',
    2017 => '2017年',
    2018 => '2018年',
    2019 => '2019年',
    2020 => '2020年',
    2021 => '2021年',
    2022 => '2022年',
];

$config['prize_type'] = [
    1 => '签到礼品',
    2 => '问答礼品',
    4 => '每日抽奖礼品',
    5 => '每日任务奖励',
    6 => '小游戏-100%升级券',
    7 => '积分抽奖礼品',
    8 => '四星烟抽奖礼品',
    9 => '五星烟抽奖礼品',
];

$config['spend_type'] = [
    1 => '购买商品',
    2 => '兑换银元',
    3 => '兑换闪电',
    4 => '升级仓库',
    5 => '升级醇化室',
    6 => '租赁制烟机',
    7 => '扩展培育槽',
    8 => '品鉴花费',
    9 => '升级实体烟',
    10 => '刷新订单',
    11 => '刷新神秘商店',
    12 => '抽奖',
    13 => '发布广告',
    14 => '种植加速',
    15 => '自动烘烤',
    16 => '醇化加速',
    17 => '制烟加速',
    18 => '升级土地',
    19 => '出售商品'
];
